package com.thorin.apps.asmal.ui.menu.ratib

import android.annotation.SuppressLint
import android.os.Bundle
import android.widget.SeekBar
import androidx.appcompat.app.AppCompatActivity
import com.thorin.apps.asmal.R
import kotlinx.android.synthetic.main.activity_ratib_alathos.*


class RatibAlathosActivity : AppCompatActivity() {
    @SuppressLint("SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_ratib_alathos)
        supportActionBar?.hide()
        text_athos.text = """
            اِلٰى حَضْرَةِ النَّبِيِّ الْمُصْطَفٰى مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاٰلِهِ وَاَصْحَابِهِ وَاَزْوَاجِهِ وَذُرِّيَّاتِهِ لَهُمُ الْفَاتِحَة

            الْفَاتِحَة : أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ. بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ. رَبِّ اغْفِرْلِيْ وَلِوَالِدَيَّ آمِيْن

            اَعُوْذُبِا للهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَا نِ الرَّجِيْمِ(x3)

            لَوْاَنْزَلْنَا هَذَا الْقُرْآنَ عَلَى جَبَلٍ لَرَاَيْتَهُ خَاشِعًا مُتَصَدّعًا مِنْ خَشْيَةِ اللهِ وِتِلْكَ اْلاَمْثَالُ نَضْرِبُهَا لِلنَاسِ لَعَلَّهُمْ يَتَفَكَّرُوْنَ. هُوَاللهُ الَّذِيْ لاَاِلَهَ اِلاَّ هُوَعَالِمُ اْلغَيْبِ وَالشَّهَادَةِ هُوَالرَّحْمَنُ الرَّحِيْمُ هُوَاللهُ الَّذِيْ لآ اِلَهَ اِلاَّ هُوَاْلمَلِكُ اْلقُدُّوْسُ السَّلاَمُ اْلمُؤْمِنُ اْلمُهَيْمِنُ اْلعَزِيْزُ اْلجَبَارُ اْلمُتَكَبِّرُ سُبْحَانَ اللهِ عَمَّا يُشْرِكُوْنَ هُوَاللهُ اْلخَالِقُ اْلبَارِئُ اْلمُصَوِّرُ لَهُ اْلاَسْمَاءُ اْلحُسْنَى يُسَبِّحُ لَهُ مَافِى السَّمَوَاتِ وِاْلاَرْضِ وَهُوَ الْعَزِيْزُاْلحَكِيْم

            اَعُوْذُبِاللهِ السَّمِيْحِ اْلعَلِيْمِ مِنْ الشَّيْطَانِ الرَّجِيْمِ (3x)

            اَعُوْذُ بِكَلِمَاتِ اللهِ التَّا مَّاتِ مِنْ شَرِّمَا خَلَقَ (3x)

            بِسْمِ اللهِ الَّذِيْ لاَيَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى اْلاَرْضِ وَلاَفِى السَّمَاءِ وَهُوَ السَّمِيْعُ الْعَلِيْمُ (3x)

            بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ.وَلاَحَوْلَ وَلاَ قُوَّةَ اِلاَّبِاللهِ الْعَلِيّ الْعَظِيْمِ (10x)

            بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ(3x)

            بِسْمِ اللهِ تَحَصَّنَّا بِاللهِ.بِسْمِ اللهِ تَوَكَّلْنَا بِا للهِ(3x)

            بِسْمِ اللهِ آمَنَّابِاللهِ. وَمَنْ يُؤْمِنْ بِاللهِ لاَخَوْفٌ عَلَيْهِ (3x)

            سُبْحَانَ اللهِ عَزَّاللهِ. سُبْحَانَ اللهِ جَلَّ اللهِ (3x)

            سُبْحَانَ اللهِ وَبِحَمْدِهِ.سُبْحَانَ اللهِ الْعَظِيْمِ (3x)

            سُبْحَانَ اللهِ وَالْحَمْدُلِلَّهِ وَلآ اِلَهَ اِلاَّ اللهُ وَاللهُ اَكْبَرُ (4x)

            يَالَطِيْفًا بِخَلْقِهِ يَاعَلِيْمًا بِخَلْقِهِ يَاخَبِيْرًا بِخَلْقِهِ. اُلْطُفْ بِنَايَالَطِيْفُ يَاعَلِيْمُ يَاخَبِيْرً (3x)

            يَا لَطِيْفًا لَمْ يَزَلْ. اُلْطُفْ بِنَا فِيْمَا نَزَلْ اِنَّكَ لَطِيْفٌ لَمْ تَزَلْ. اُلْطُفْ بِنَاوَ الْمُسْلِمِيْنَ (3x)

            لآ اِلَهَ اِلاَّ اللهُ (40x)

            مُحَمَّدٌ رَسُوْلُ اللهَ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّم

            حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيْلُ (7x)

            اَللَّهُمَّ صَلِّ عَلَّى مُحَمَّدٍ. اَللَّهُمَّ صَلِّ عَلَيْهِ وَسَلِّمْ(10x)

            اَسْتَغْفِرَالله(11x)

            تَائِبُوْنَ اِلَى اللهِ(3x)

            يَآللهُ بِهَا.يَآَللهُ بِهَا يَآَللهُ بِحُسْنِ اْلخَاتِمَةِِ(3x)

            غُفْرَا نَكَ رَبَّنَا وَاِلَيْكَ اْلمَصِيْرُ لاَيُكَلِفُ اللهُ نَفْسًا اِلاَّ وُسُعَهَا لَهَا مَا اكَسَبَتْ وَعَلَيْهَا مَا اكَتَسَبَتْ رَبَّنَا لاَ تُؤَا خِذْنَا اِنْ نَسِيْنَا اَوْاَخْطَأْ نَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا اِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِيْنَ مِنْ قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَا قَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْلَنَا وَارْحَمْنَا اَنْتَ مَوْلاَ نَا فَانْصُرْنَا عَلَى اْلقَوْمِ اْلكَا فِرِيْن
            اَلْفَاتِحَةُ اِلَى رُوْحِ سَيِّدِنَا وَحَبِيْبِنَا وَشَفِيْعِنَ رَسُوْلِ اللهِ مُحَمَّدِ بِنْ عَبْدِاللهِ وَاَلِهِ وَاَصْحَابِهِ وَاَزْوَاجِهِ وَذُرِّيَّتِهِ اَنَّ اللهَ يُعْلىِ دَرَجَاتِهِمْ فِى اْلْجَنَّةِ وَ يَنْفَعُنَا بِاَسْرَارِ هِمْ وَاَنْوَارِهِمْ وَعُلُوْمِهِمْ فِى الدِّيْنِ وَالدُّنْيَا وَاْلآ خِرَةِ وَيَجْعَلُنَا مِنْ حِزْ بِهِمْ وَيَرْزُقُنَا مَحَبَّتَهُمْ وَيَتَوَفَّانَا عَلَى مِلَّتِهِمْ وَيَحْشُرُنَا فِى زُمْرَ تِهِمْ . فِى خَيْرٍ وَ لُطْفٍ وَعَافِيَةٍ بِسِرِالْفَا تِحَة

            اَلْفَاتِحَةُ اِلَى رُوْحِ سَيِّدِنَا الْمُهَاجِرْ اِلَى اللهِ اَحْمَدْ بِنْ عِيْسَى وَاِلَى رُوْحِ سَيِّدِنَا اْلاُ سْتَاذِ اْلاَعْظَمِ اَلْفَقِيْهِ الْمُقَدَّمِ مُحَمَّدِ بْنِ عَلِيّ بَاعَلَوِيْ وَاُصُوْلِهِمْ وَفُرُوْعِهِمْ وَذَوِىْ الْحُقُوْقِ عَلَيْهِمْ اَجْمَعِيْنَ اَنَّ اللهَ يَغْفُرُ لَهُمْ وَيَرْ حَمُهُمْ وَيُعْلِيْ دَرَجَاتِهِمْ فِى الْجَنَّةِ وَيَنْفَعُنَا بِاَسْرَارِهِمْ وَاَنْوَارِهِمْ وَعُلُوْمِهِمْ فِى الدِّيْنِ وَالدُّنْيَاوَاْلاَخِرَةِ اَلْفَاتِحَة

            اَلْفَاتِحَةُ اِلَى رُوْحِ سَيّدِنَا وَحَبِيْبِنَا وَبَرَكَاتِنَا صَاحِبِ الرَّاتِبِ قُطْبِ اْلاَنْفَاسِ اَلْحَبِيْبِ عُمَرْ بِنْ عَبْدِالرَّحْمَنِ الْعَطَّاسْ ثُمَّ اِلَى رُوْحِ الشَّيْخِ عَلِيّ بْنِ عَبْدِ اللهِ بَارَاسْ ثُمَّ اِلَى رُوْحِ اَلْحَبِيْب عَبْدُالرَّحْمَنِ بِنْ عَقِيْل اَلْعَطَّاسْ ثُمَّ اِلَى رُوْحِ اَلْحَبِيْب حُسَيْن بِنْ عُمَرْ اَلْعَطَّاسْ وَاِخْوَانِهِ ثُمَّ اِلَى رُوْحِ عَقِيْل وَعَبْدِ اللهِ وَصَا لِحْ بِنْ عَبْدُالرَّحْمَنِ اَلْعَطَّاسْ ثُمَّ اِلَى رُوْحِ اَلْحَبِيْب عَلِيّ بْنِ حَسَنْ اَلْعَطَّاسْ ثُمَّ اِلَى رُوْحِ اَلْحَبِيْب اَحْمَدْ بِنْ حَسَنْ اَلْعَطَّاسْ وَاُصُوْلِهِمْ وَفُرُوْعِهِمْ وَذَوِى الْحُقُوْقِ عَلَيْهِمْ اَجْمَعِيْنَ اَنَّاللهَ يَغْفِرُ لَهُمْ وَيَرْ حَمُهُمْ وَيُعْلِى دَرَجَا تِهِمْ فِى الْجَنَّةِ وَيَنْفَعُنَا بِاَسْرَارِهِمْ وَاَنْوَارِهِمْ وَعُلُوْ مِهِمْ وَنَفَحَا تِهِمْ فِى الدِّيِنِ وَالدُّ نْيَاوَاْلآخِرَةِ أَلْفَا تِحَة

            اَلْفَاتِحَةُ اِلَى اَرْوَحِ اْلاَوْالِيَاءِ وَالشُّهَدَاءِ وَالصَّا لِحِيْنَ وَاْلاَئِمَّةِ الرَّاشِدِيْنَ وَاِلَى اَرْوَاحِ وَالِدِيْنَا وَمَشَا يِخِنَا وَذَوِى الْحُقُوْقِ عَلَيْنَا وَعَلَيْهِمْ اَجْمَعِيْنَ ثُمَّ اِلَى اَرْوَاحِ اَمْوَاتِ اَهْلِ هَذِهِ الْبَلْدَةِ مِنَ الْمُسْلِمِيْنَ وَ الْمُسْلِمَاتِ اَنَّ اللهَ يَغْفِرُلَهُمْ وَيَرْحَمُهُمْ وَيُعْلِى دَرَجَاتِهِمْ فِى الْجَنَّةِ وَيُعِيْدُ عَلَيْنَا مِنْ اَسْرَ ارِهِمْ وَانْوَ ارِهِمْ وَعُلُوْ مِهِمْ وَبَرَكَاتِهِمْ فِى الدِّيْنِ وَالدُّنْيَا وَاْلآخِرَةِ اَلْفَاتِحَة

            اَلْفَاتِحَةُ بِالْقَبُوْلِ وَتَمَامِ كُلّ سُوْلٍ وَمَأْمُوْلٍ وَصَلاَحِ الشَّأْنِ ظَا هِرًا وَبَا طِنًافِى الدِّيْنِ وَالدُّنْيَا وَاْلآخِرَةِ دَافِعَةً لِكُلِّ شَرٍّجَالِبَةً لِكُلِّ خَيْرٍلَنَا وَلِوَ الِدِيْنَا وَاَوْلاَدِنَا وَاَحْبَا بِنَا وَمَشَا ئِخِنَا فِى الدِّيْنِ مَعَ اللُّطْفِ وَالْعَافِيَةِ وَعَلَى نِيَّةِ اَنَّ اللهَ يُنَوِّرُ قُلُوْ بَنَا وَقَوَ الِبَنَا مَعَ الْهُدَى وَالتَّقَى وَالْعَفَافِ وَالْغِنَى وَالْمَوْتِ عَلَى دِيْنِ اْلاِسَلاَمِ وَاْلاِ يْمَانِ بِلاَ مِحْنَةٍ وَلاَ اِمْتِحَانٍ بِحَقِّ سَيِّدِ نَاوَلَدِ عَدْ نَانِ وَعَلَى كُلِّ نِيَّةٍ صَالِحَةٍ وَاِلَى حَضْرَةِ النَِّبيّ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ أَلْفَاتِحَة

            بِسْمِ اللهِ الرَّ حْمَنِ الرَّ حِيْمِ. اَلْحَمْدُ لِلَّهِ رَبِّ الْعَا لَمِيْنَ حَمْدًا يُوَافِى نِعَمَهُ وَيُكَافِىءُ مَزِيْدَهُ يَا رَبَّنَا لَكَ الْحَمْدُ كَمَا يَنْبَغِىْ لِجَلاَلِ وَجْهِكَ وَعَظِيْمِ سُلْطَا نِكْ سُبْحَا نَكَ لاَ نُحْصِيْ ثَنَا ءً عَلَيْكَ اَنْتَ كَمَا اَثْنَيْتَ عَلَى نَفْسِكَ فَلَكَ الْحَمْدُ حَتىَّ تَرْضَى وَلَكَ الْحَمْدُ اِذَارَضِيْتَ وَلَكَ الْحَمْدُ بَعْدَ الرِّضَى اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِى اْلاَوَّلِيْنَ وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنّا مُحَمَّدٍ فِى اْلآخِرِيْنَ وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِى كُلِّ وَقْتٍ وَحِيْنٍ وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ فِى الْمَلَإِ اْلاَعْلَى اِلَى يَوْمِ الدِّيْنِ وَصَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ حَتىَّ تَرِثَ اْلاَرْضَ وَمَنْ عَلَيْهَا وَاَنْتَ خَيْرُ الْوَارِثِيْنَ اَللَّهُمَّ اِنَّا نَسْتَحْفِظُكَ وَنَسْتَوْ دِعُكَ اَدْيَا نَنَا وَاَنْفُسَنَا وَاَمْوَالَنَا وَاَهْلَنَا وَكُلَّ ثَيْءٍ اَعْطَيْتَنَا اَللَّهُمَّ اجْعَلْنَا وَاِيَّاهُمْ فِى كَنَفِكَ وَاَمَانِكَ وَعِيَاذِكَ مِنْ كُلِّ شَيْطَانٍ مَرِيْدٍ وَجَبَّارٍ عَنِيْدٍ وَذِىْ عَيْنٍ وَذِيْ بَغْيٍ وَذِيْ حَسَدٍ وَمِنْ شَرِّ كَلِّ ذِيْ شَرٍّ اِنَّكَ عَلَى كُلِّ شّيْىءٍ قَدِيْرُ اَللَّهُمَّ جَمّلْنَا بِالْعَافِيَةِ وَالسَّلاَمَةِ وَحَقِقْنَا بِآتَقْوَى وَاْلاِسْتِقَامَةِ وَاِعِذْنَا مِنْ مُوْجِبَاتِ النَّدَامَةِ فِى اْلحَالِ وَاْلمالِ اِنَّكَ سَمِيْعُ الدُّعَاءِ وَصَلِّ اللَّهُمَّ بِجَلاَلِكَ وَجَمَالِكَ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ اَجْمَعِيْنَ وَارْزُقْنَا كَمَالَ اْلمُتَا بَعَةِ لَهُ ظَا هِرًا وَبَا طِنًا يَا اَرْحَمَ الرَّاحِمِيْنَ بِفَضْلِ سُبْحَانَ رَبِّكَ رَبِّ اْلعِزَّةِ عَمَّا يَصِفُوْنَ وَسَلاَمُ عَلَى اْلمُرْسَلِيْنَ وَلْحَمْدُلِلَّهِ رَبّ اْلعَالَمِيْن

        """.trimIndent()

        seekBarathos.setOnSeekBarChangeListener(object: SeekBar.OnSeekBarChangeListener {
            internal var p = 0
            override fun onStopTrackingTouch(seekBar:SeekBar) {
                // TODO Auto-generated method stub
                if (p < 30)
                {
                    p = 30
                    seekBar.progress = p
                }
            }

            override fun onProgressChanged(seekBar:SeekBar, progress:Int, fromUser:Boolean) {
                // TODO Auto-generated method stub
                p = progress
                text_athos.textSize = p.toFloat()
            }

            override fun onStartTrackingTouch(seekBar:SeekBar) {
                // TODO Auto-generated method stub
            }
        })
    }
}