package com.thorin.apps.asmal.view.ui.menu.ratib

import android.annotation.SuppressLint
import android.os.Bundle
import android.widget.SeekBar
import androidx.appcompat.app.AppCompatActivity
import com.thorin.apps.asmal.R
import kotlinx.android.synthetic.main.activity_ratib_alhaddad.*

class RatibAlhaddadActivity : AppCompatActivity() {
    @SuppressLint("SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_ratib_alhaddad)
        supportActionBar?.hide()
        text_alhaddad.text = """
            اِلٰى حَضْرَةِ النَّبِيِّ الْمُصْطَفٰى مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاٰلِهِ وَاَصْحَابِهِ وَاَزْوَاجِهِ وَذُرِّيَّاتِهِ لَهُمُ الْفَاتِحَة

            الْفَاتِحَة : أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ. بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ. رَبِّ اغْفِرْلِيْ وَلِوَالِدَيَّ آمِيْن

            وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لاَّ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيم

            اَللهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّوْمُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَه إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيْطُوْنَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَآءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤدُه حِفْظُهُمَا وَهُوَ العَلِيُّ العَظِيْمُ . لِلَّهِ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَإِن تُبْدُوا مَا فِىٓ أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ ٱللَّهُ فَيَغْفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ . آمَنَ الرَّسُوْلُ بِمَآ أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُوْنَ كُلٌّ آمَنَ بِاللهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْناَ وَأَطَعْناَ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيْرُ. لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَآ إِنْ نَسِيْنَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِيْنَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَالاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنآ أَنْتَ مَوْلاَنَا فَانْصُرْناَ عَلَى الْقَوْمِ الْكَافِرِيْن

            لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيْتُ وَهُوَ عَلَى كُلّ شَيْءٍ قَدِيرٌُ(x3)

            سُبْحَانَ اللهِ وَالْحَمْدُ لِلّهِ وَلَا إِلَهَ إِلَّا اْللهُ وَاللهُ اَكْبَرُ(x3)

            سُبْحَانَ اللهِ وَبِحَمْدِهِ سُبْحَانَ اللهِ الْعَظِيْمِ(x3)

            رَبَّنَا اغْفِرْ لَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيْمُ(x3)

            اَللّهُمَّ صَلِّ عَلَى مُحَمَّدٍ اَللّهُمَّ صَلِّ عَلَيْهِ وَسَلِّمْ(x3)

            أَعُوْذُ بِكَلِمَاتِ اللهِ التَّآمَّاتِ مِنْ شَرِّمَا خَلَقَ(x3)

            بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي الْسَّمَآءِ وَهُوَ الْسَّمِيْعُ الْعَلِيْمُ(x3)

            رَضِيْنَا بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِيْنًا وَبِمُحَمَّدٍ نَبِيًّا(x3)

            بِسْمِ اللهِ وَالْحَمْدُ لِلّهِ وَالْخَيْرُ وَالشَّرُّ بِمَشِيْئَةِ اللهِ(x3)

            آمَنَّا بِاللهِ وَاليَوْمِ الآخِرِ تُبْناَ إِلَى اللهِ باَطِناً وَظَاهِرًا(x3)

            يَا رَبَّنَا وَاعْفُ عَنَّا وَامْحُ الَّذِيْ كَانَ مِنَّا(x3)

            ياَ ذَا الْجَلاَلِ وَالإِكْراَمِ أَمِتْناَ عَلَى دِيْنِ الإِسْلاَمِ(x7)

            ياَ قَوِيُّ ياَ مَتِيْنُ اكْفِ شَرَّ الظَّالِمِيْنَ(x3)

            أَصْلَحَ اللهُ أُمُوْرَ الْمُسْلِمِيْنَ صَرَفَ اللهُ شَرَّ الْمُؤْذِيْنَ(x3)

            يَا عَلِيُّ يَا كَبِيْرُ يَا عَلِيْمُ يَا قَدِيْرُ يَا سَمِيعُ يَا بَصِيْرُ يَا لَطِيْفُ يَا خَبِيْرُ(x3)

            ياَ فَارِجَ الهَمّ يَا كَاشِفَ الغَّمّ يَا مَنْ لِعَبْدِهِ يَغْفِرُ وَيَرْحَمُ(x3)

            أَسْتَغْفِرُ اللهَ رَبَّ الْبَرَايَا أَسْتَغْفِرُ اللهَ مِنَ الْخَطَاياَ(4x)

            لاَ إِلَهَ إِلاَّ اللهُ لاَ إِلَهَ إِلاَّ اللهُ(25x)

            مُحَمَّدٌ رَسُوْلُ اللهِ صَلَّى اللهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ وَشَرَّفَ وَكَرَّمَ وَمَجَّدَ وَعَظَّمَ وَرَضِيَ اللهُ تَعاَلَى عَنْ اَهْلِ بَيْتِهِ الطَّيّبِيِنَ الطَّاهِرِيْنَ وَأَصْحَابِهِ الأَكْرَمِيْنَ الْمُهْتَدِيْنَ. وَأَزْوَاجِهِ الطَّاهِرَاتِ أُمَّهَاتِ الْمُؤْمِنِيْنَ. وَ التَّابِعِيْنَ لَهُمْ بِإِحْسَانٍ إِلَى يَوْمِ الدِّيْنِ وَعَلَيْناَ مَعَهُمْ وَفِيْهِمْ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِيْن

            بِسْم اللهِ الرَّحْمنِ الرَّحِيْمِ. قُلْ هُوَ اللهُ أَحَدٌ. اَللهُ الصَّمَدُ. لَمْ يَلِدْ وَلَمْ يٌوْلَدْ. وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ(3x)

            بِسْم اللهِ الرَّحْمنِ الرَّحِيْمِ. قُلْ أَعُوْذُ بِرَبِّ الْفَلَقِ. مِنْ شَرِّ ماَ خَلَقَ. وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ. وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ. وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَد(1x)

            بِسْم اللهِ الرَّحْمنِ الرَّحِيْمِ. قُلْ أَعُوْذُ بِرَبِّ النَّاسِ. مَلِكِ النَّاسِ. إِلهِ النَّاسِ. مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ. اَلَّذِيْ يُوَسْوِسُ فِي صُدُوْرِ النَّاسِ. مِنَ الْجِنَّةِ وَالنَّاسِ(1x)

            اَلْفَاتِحَةَ إِلَى رُوحِ سَيّدِنَا الشَّيْخِ الْكَبِيْرِ الْقُطْبِ الشَّهِيْرِ الْفَقِيْهِ الْمُقَدَّمِ مُحَمَّدِ بْنِ عَلِي بَاعَلَوي وَأُصُولِهِ وَفُرُوعِهِ وَجَمِيْعِ سَادَاتِنَا آلِ بَاعَلَوِي أَنَّ اللهَ يُعْلِيْ دَرَجَاتِهِمْ فِي الْجَنَّةِ وَيُعِيْدُ عَلَيْنَا مِنْ بَرَكَاتِهِمْ وَ أَسْرَارِهِمْ وَأَنْوَارِهِمْ وَ عُلُوْمِهِمْ وَ نَفَحَاتِهِمْ فِي الدِّيْنِ وَالدُّنْيَا وَالآخِرَةِ. (اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ)

            اَلْفَاتِحَةَ إِلَى أَرْوَاحِ ساَدَاتِنَا الصُّوْفِيَّةِ أَيْنَمَا كَانُوْا مِنْ مَشَارِقِ الأَرْضِ إِلَى مَغَارِبِهَا أَنَّ اللهَ يَحْمِيْنَا بِحِمَايَتِهِمْ وَيُمِدُّنَا بِمَدَدِهِمْ وَيُعِيْدُ عَلَيْنَا مِنْ بَرَكَاتِهِمْ وَ أَسْرَارِهِمْ وَأَنْوَارِهِمْ وَ عُلُوْمِهِمْ وَ نَفَحَاتِهِمْ فِي الدِّيْنِ وَالدُّنْيَا وَالآخِرَةِ. (بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ)

            اَلْفَاتِحَةَ إِلَى رُوْحِ سَيِّدِنَا الشَّيْخِ الْكَبِيْرِ الْقُطْبِ الشَّهِيْرِ الْحَبِيْبِ عَبْدِ اللهِ بْنِ عَلَوِي بْنِ مُحَمَّدٍ الْحَدَّادِ صَاحِبِ الرَّاتِبِ وَأُصُوْلِهِ وَفُرُوْعِهِ وَجَمِيْعِ سَادَاتِنَا آلِ بَاعَلَوِي أَنَّ اللهَ يُعْلِيْ دَرَجَاتِهِمْ فِي الْجَنَّة وَيُعِيْدُ عَلَيْنَا مِنْ بَرَكَاتِهِمْ وَ أَسْرَارِهِمْ وَأَنْوَارِهِمْ وَ عُلُوْمِهِمْ وَ نَفَحَاتِهِمْ فِي الدِّيْنِ وَالدُّنْيَا وَالآخِرَةِِ. (بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ)

            اَلْفَاتِحَةَ أَنَّ اللهَ يُغِيْثُ الْمُسْلِمِيْنَ وَيَرْحَمُ الْمُسْلِمِيْنَ وَيُفَرِّجُ عَلَى الْمُسْلِمِيْنَ وَيَشْفِيْ أَمْرَاضَ الْمُسْلِمِيْنَ بِالْعَافِيَةِ وَيُغَزِّرُ أَمْطَارَهُمْ وَيُرَخِّصُ أَسْعَارَهُمْ وَيُصْلِحُ سَلاَطِيْنَهُمْ وَيَكْفِيْهِمْ شَرَّ الْفِتَنِ وَ الْبَلِيَّاتِ وَ الْمِحَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَ يَحْفَظُ الْحُجَّاجَ وَ الْمُسَافِرِيْنَ وَ الْغُزَاةِ وَ الْمُجَاهِدِيْنَ مِنَ الْمُسْلِمِيْنَ فِيْ الْبَرِّ وَ الْبَحْرِ وَ الْجَوِّ أَجْمَعِيْنَ. أَنَّ اللهَ يُصْحِبُهُمُ السَّلاَمَةَ وَ يَرُدُّهُمْ إِلَى أَوْطَانِهِمْ سَالِمِيْنَ آمِنِيْنَ غَائِمِيْنَ وَ إِيَّانَا فِيْ خَيْرٍ وَ عَافِيَةٍ وَ إِلَى أَرْوَاحِ وَالِدِيْنَ وَ وَالِدِيْكُمْ وَ أَمْوَاتِنَا وَ أَمْوَاتِكُمْ وَ أَمْوَاتِ الْمُسْلِمِيْنَ أَجْمَعِيْنَ. أَنَّ اللهَ يَتَغَشَّاهُمْ بِالرَّحْمَةِ وَ الْمَغْفِرَةِ وَ يُسْكِنُهُمُ الْجَنَّةَ وَ يَخْتِمُ لَنَا وَلَكُمْ بِالْحُسْنَى فِيْ خَيْرٍ وَ لُطْفٍ وَ عَافِيَةٍ وَ إِلَى حَضْرَةِ النَّبِيّ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَ سَلَّم. (بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ للهِ رَبِّ الْعَالَمِيْنَ. اَلرَّحْمنِ الرَّحِيْمِ. ماَلِكِ يَوْمِ الدِّيْنِِ. إِيِّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلاَ الضَّآلِّيْنَ)

            --Doa--

            بِسْم اللهِ الرَّحْمنِ الرَّحِيْمِ. اَلْحَمْدُ اللهِ رَبِّ العَالَمِيْنَ حَمْدًا يُوَافِي نِعَمَهُ وَيُكَافِئُ مَزِيْدَهُ. اَللّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى أَهْلِ بَيْتِهِ وَسَلِّمْ. اَللّهُمَّ إِنَّا نَسْأَلُكَ بِحَقِّ الْفَاتِحَةِ الْمُعَظَّمَةِ وَالسَّبْعِ الْمَثَانِيْ أَنْ تَفْتَحَ لَنَا بِكُلِّ خَيْرٍ. وَأَنْ تَتَفَضَّلَ عَلَيْنَا بِكُلِّ خَيْرٍ. وَأَنْ تُعَامِلَنَا مُعَامَلَتَكَ لأَهْلِ الْخَيْرِ. وَأَنْ تَجْعَلَنَا مِنْ أَهْلِ الْخَيْرِ وَأَنْ تَحْفَظَنَا فِي دِيْنِنَا وَأَنْفُسِنَا وَأَوْلاَدِنَا وَاَهْلِيْنَا وَأَصْحَابِنَا وَأَحْبَابِنَا مِنْ كُلِّ مِحْنَةٍ وَ فِتْنَةٍ وَبُؤْسٍ وَضَيْرٍ إِنَّكَ وَلِيُّ كُلِّ خَيْرٍ وَمُعْطٍ لِكُلِّ خَيْرٍ وَمُتَفَضِّلٌ بِكُلِّ خَيْرٍ يَا أَرْحَمَ الرَّاحِمِيْن. وَ صَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ. وَ الْحَمْدُ لِلّهِ رَبِّ الْعَالَمِيْنَ

            اَللّهُمَّ إِنَّا نَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ وَنَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ(x3)

            يَا عَالِمَ السِّرِّ مِنَّا لاَ تَهْتِكِ السِّتْرَ عَنَّا وَ عَافِنَا وَاعْفُ عَنَّا وَ كُنْ لَنَا حَيْثُ كُنَّا(x3)

            يَا الله بِهَا يَا الله بِهَا يَا الله بِحُسْنِ الخَاَتِمَةِ(x3)

            يَا لَطِيْفًا بِخَلْقِهِ يَا عَلِيْمًا بِخَلْقِهِ يَا خَبِيْرًا بِخَلْقِهِ اُلْطُفِ بِنَا يَا لَطِيْفُ يَا عَلِيْمُ يَا خَبِيْرُ(x3)

            يَا لَطِيْفًا لَمْ يَزَلْ اُلْطُفْ بِنَا فِيْمَا نَزَلَ إِنَّكَ لَطِيْفٌ لَمْ تَزَلْ اُلْطُفْ بِنَا وَ الْمُسْلِمِيْنَ(x3)

            جَزَى اللهُ سَيِّدَنَا مُحَمَّدًا عَنَّا خَيْرًا جَزَى اللهُ سَيِّدَنَا مُحَمَّدًا عَنَّا مَا هُوَ أَهْلُهُ(x3)

            الْحَمْدُ لِلّهِ عَلَى نِعْمَةِ الإِيْمَانِ وَ الإِسْلاَمِ وَ تَوْفِيْقِهِ وَكَفَى بِهَا مِنْ نِعْمَةٍ

        """.trimIndent()

        seekBar.setOnSeekBarChangeListener(object: SeekBar.OnSeekBarChangeListener {
            internal var p = 0
            override fun onStopTrackingTouch(seekBar:SeekBar) {
                // TODO Auto-generated method stub
                if (p < 30)
                {
                    p = 30
                    seekBar.progress = p
                }
            }

            override fun onProgressChanged(seekBar:SeekBar, progress:Int, fromUser:Boolean) {
                // TODO Auto-generated method stub
                p = progress
                text_alhaddad.textSize = p.toFloat()
            }

            override fun onStartTrackingTouch(seekBar:SeekBar) {
                // TODO Auto-generated method stub
            }
        })
    }
}