package com.thorin.apps.asmal.utils

import com.thorin.apps.asmal.model.ListSholawatData

@Suppress("UNCHECKED_CAST")
class ListSholawatHelper {

    companion object {
        fun <ArrayList> getVersionsList(): ArrayList {
            val courseList = ArrayList<ListSholawatData>()
            courseList.add(ListSholawatData("Khoirul bariyyah", """   
خَيرُ البَرِيَّة نَظرَه اِلَىَّ
مَا اَنتَ اِلاَّكَنزُ العَطِيَّة
                        
يَابَحرَ فَضلٍ وَتَاجَ عَدلٍ
جُدلِى بِوَصلٍ قَبلَ المَنِيَّةِ
                        
حَاشَاكَ تَغفُل عَنَّا وَتَبخَل
يَاخَيرَ مُرسَل اِرحَم شَجِيَّه
                        
كَم ذَااُنَادِى يَاخَيرَهَادِى
قَصدِى مُرَادِى عَطفُاعَلَىَّ
                        
اُهدِكَ حِبِّى صَلاَةَ رَبِّى
مَادَامَ قَلبِى بِالذِّكرِ حَيَّ
                
            """.trimIndent()))
            courseList.add(ListSholawatData("Busyrolana", """            
بُشـرٰي لَنَا نِلْنَا اْلمُنىٰ
زَالَ الْعَنَى وَافَا اْلهَنَا
        
وَالدَّهْرُاَنْجَزَوَعْدَهُ
وَالْبِشْرُاَضْحَى مُعْلَنَا
        
يَانَفْسُ طِيبِي بِاللَّقَا
يَاعَيْنُ قَرِّى اَعْيُنَا
        
هٰذَاجَمَالُ الْمُصْطَفَى
اَنْوَارُهُ لاَ حَتْ لَنا
        
يَا طَيْبَةُ مَا ذَانَقُولْ
وَفِيكِ قَدْ حَلّ الرَّسُولْ
        
وَكُلُّنا يَرْجُوالوُصُؤل
لـِمُحمَّدٍ نَبِــيَّنَا
        
يَارَوْضَةَالْهَادِالشَّفِيعِ
وَصَاحِبِيْهِِ وَالْبَقِيعِ
        
اُكْتُبْ لَنَا نَحْنُ الْجَمِيعُ
زِيَارَةًلِحَبِيبِنَا

صَلِّ وَسَلِّمْ يَا سَلاَمْ
عَلَى النَّبِى مَا حِى الظَّلاَمْ
        
وَالْأَلِ وَالصَّحْبِ الْكِرَامْْ
مَا أُنْشِدَتْ بُشْرَى لَناَ
        
            """.trimIndent()))
            courseList.add(ListSholawatData("Ahmad Ya Habibi", """             
أَحْمَدْ يَا حَبِيْبِي سَلَامْ عَلَيْكَ
                       
يَاعَوْنَ الْغَرِيْبِ سَلَامْ عَلَيْكَ
                        
اَمْنٌ وَسَلَامٌ سَلَامْ عَلَيْكَ
                        
دِيْنُكَ الْإِسْلَامُوسَلَامْ عَلَيْكَ
                        
جِئْتَ بِالْقُرْاَنِ سَلَامْ عَلَيْكَ
                       
مِنْ عِنْدِارَّحْمٰنِ سَلَامْ عَلَيْكَ

جِئْتَ بِلتَّوْحِيدِ سَلَامْ عَلَيْكَ

فُزْتَ بِاتَّمْجِيْدِ سَلَامْ عَلَيْكَ

وَنِلنَاالخَيْرَاتِ سَلَامْ عَلَيْكَ

فِىْ مِنٰى وَعَرَفَاتِ سَلَامْ عَلَيْكَ

وَمَحَوْنَا السَّيِّئَاتِ سَلَامْ عَلَيْكَ

بِرَجْمِ الجَمَرَاتِ سَلَامْ عَلَيْكَ
                
            """.trimIndent()))
            courseList.add(ListSholawatData("Sholatum Bissalamil Mubini", """              
صَلاَةٌ بِالسَّلاَمِ المُبِينِ
لِنُقطَةِ التَّعيِينِ يَاغَرَامِى
                        
نَبِيٌّ كَانَ الصلَ التَّكوِينِ
مِن عَهدِ كُن فَيَكُون يَاغَرَامِي
                        
اَيَّامَن جَاءَنَا حَقًّا نَذِيرِ
مُغِيثًامُسبِلا سُبُلَ الرَّشَادِ
                        
رَسُولُ اللهِ يَاضَاوِي الجَبِينِ
وَيَامَن جَاءَ بِالحَقِّ المُبِينِ
                        
صَلاَةُ لَم تَزَل تُتلى عَلَيكَ
كَمِعطَارِ النِّسِيمِ تُهدى الَيك
                
            """.trimIndent()))
            courseList.add(ListSholawatData("Sholli Wa Sallim Daiman", """               
صَلِّ وَسَلِّمْ دَائِمًا عَلَى احْمَدَا
وَالْآلِ وَالْأَصْحَابِ مَنْ قَدْ وَحَّدَا
                        
أَحْمَدُ الْمُصْطَفَى ذَوَا السَّمَاحَةْ
مُنْقِذُ مَنْ لِذَنْبِهِ نَدَامَةْ
بِهِ أَرْجُو الرِّضَا وَقَبُوْلَ التَّوْبَةْ
                        
تَوَسَّلْنَا بِجَاهِكَ يَا طَيْبَةْ
فِيْ نَيْلِ عَدَدِ الْمُنَى يَا طَيْبَةْ
وَالْآلِ وَالْأَصْحَابِ وَالذُّرِّيَّةْ
                        
تَقَبَّلْ يَا اَللهْ فِيْنَا شَفَاعَتَهْ
عَنْ كُرْبِ دِيْنِنَا وَأَمْرِ الْعَاجِلَةْ
بِجَاهِ الْمُصْطَفَى صَاحِبِ الشَّفَاعَةْ
                
            """.trimIndent()))
            courseList.add(ListSholawatData("Qul Ya Adhim", """               
قُلْ يَاعَظِيْم أَنْتَ الْعَظِيْم
قَدْ هَمَّنَا هَمٌّ عَظِيْم
                        
وكل شَيْئٍ هَمَّنَا
يَهُوْنُ بِاسْمِكَ يَاعَظِيْم
                        
اَنْتَ الْقَدِيْمُ فِي الْأَزَل
أَنْتَ الْلَّطِيْفُ لَمْ تَزَلْ
                        
عَنَّا أَزِلْ مَاقَدْ نَزَلْ
مِنْ فَادِحِ الْخَطْبِ الشَّدِيْد
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Badrotim", """               
يَا بَدْرَ تِمٍّ حَازَ كُلَّ كَمَالِ
مَاذَايُعَبِّرَ عَنْ عُلَا كَ مَقَالِى
        
اَنْتَ الَّذِى اَشْرَقْتَ فِى اُفُقِ الْعُلَى
فَمَحَوْتَ بِالْاَنْوَارِ كُلَّ ضَلَالِ
        
وَ بِكَ اسْتَنَارَ الْكَوْنُ يَا عَلَمَ الْهُدَى
بِالنُّوْرِ وَالْاِنْعَامِ وَالْإ فْضَالِ
        
رَبِّكَ اسْتَنَارَ الْكَوْنُ يَا عَلَمَ الْهُدَى
بِالنُّوْرِ وَالإِنْعَـامِ وَالإِفْضَالِ
        
صَلَّى عَلَيْكَ اللهُ رَبِّ دَآئِمًا
أَبَدًا مَعَ الإِبْكَـارِ وَالآصَـالِ
        
وَعَلَى جَمِيْعِ الآلِ وَالأَصْحَابِ مَنْ
قَدْ خَصَّهُمْ رَبُّ الْعُلاَ بِكَمَالِ
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Adhfaita", """
اَضْفَيْتَ عَلَى الْحُسْنِ الْعَبْقَا
فَالْوَرْدُ تَضَوَّع وَاعْتَنَقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
طَهِرْهُ فَلَايَحْوِى نَزَقَا

وَاجْعَلْهُ يُقَلِّدُ فِى صَبْرٍ
لِلْهَادِ فِى حُسْنِ الخُلُقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
فَالْعَبْدُ بِأَخُلَاقٍ سَبَقَا

وَاجْعَلْهُ يُقَلِّدُ فِى صَبْرٍ
لِلْهَادِ فِى حُسْنِ الخُلُقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
فَالْعَبْدُ بِأَخُلَاقٍ سَبَقَا

أَضْفَيْتَ عَلَى الْحُسْنِ الْعَبْقَا
فَالْوَرْدُ تَضَوَّع وَاعْتَنَقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
طَهِرْهُ فَلَايَحْوِى نَزَقَا

اَضْفَيْتَ عَلَى الْحُسْنِ الْعَبْقَا
فَالْوَرْدُ تَضَوَّع وَاعْتَنَقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
طَهِرْهُ فَلَايَحْوِى نَزَقَا

كَمْ اَثْنَى اللّٰهُ عَلَى خُلْقٍ
فِى اَحْمَدَ اَصْدَ قِ مَنْ صَدَقَ
قَدْاَدَّبَ رَبِّي مُرْسَلَهُ
هُوَاَكْرَمْ مَنْ رَبِّي خُلُقَ

كَمْ اَثْنَى اللّٰهُ عَلَى خُلْقٍ
فِى اَحْمَدَ اَصْدَ قِ مَنْ صَدَقَ
قَدْاَدَّبَ رَبِّي مُرْسَلَهُ
هُوَاَكْرَمْ مَنْ رَبِّي خُلُقَ

أَضْفَيْتَ عَلَى الْحُسْنِ الْعَبْقَا
فَالْوَرْدُ تَضَوَّع وَاعْتَنَقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
طَهِرْهُ فَلَايَحْوِى نَزَقَا

أَضْفَيْتَ عَلَى الْحُسْنِ الْعَبْقَا
فَالْوَرْدُ تَضَوَّع وَاعْتَنَقَا
حَسِّنْ يَارَبُّ لَنَا الخُلُقَا
طَهِرْهُ فَلَايَحْوِى نَزَقَا
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Miftahul Jannah", """
مِفْتَاحُ اْجَنَّةْ لَا اِلَهَ اِلَّا اللهْ
لَا اِلَهَ اِلَّا اللهْ مُحَمَّدٌ رَسُوْلُ اللهْ
        
نَسَبٌ تَحْسِبُ اْلعُلَا بِحُلَاهُ
قَلَّدَتْهَا نُجُومَهَا اْلجَوْزَاءُ
        
حَبَّذَا عِقْدُ سُوْدَدٍ وَفَخَارٍ
اَنْتَ فِيْهِ اْليَتِيْمَةُ اْلعَصْمَاءُ
        
حَفِظَ اْلإِلَهُ كَرَامَةً لِمُحَمَّدٍ
اَبَاءَهُ اْلاَ مْجَادَ صَوْنًا لِاسْمِهِ
        
تَرَكُوالسِّفَاحَ فَلَمْ يُصِبْهُمْ عَارُهُ
مِنْ اَدَمَ وَاِلىَ اَبِيْهِ وَاُمِّهِ
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Robba Makkah", """
يَا رَبَّ مَكّةْ وَالصَّفَا بِمُحَمَّدٍ
اِغْفِرْ لَنَا يَا سَامِعًا لِدُعَنَا
يَا رَاحِلًا اِنْ جِئْتَ وَادِى الْمُنْحَنَى
فَاحْطُطْ بِهِ وَانْزِلْ عَلَى كَنْزِ الْغِنَى
            
وَارْعَ الذِّمَامَ لِجِيْرَةٍ حَلُّوْا بِهِ
وَانْشُدْ فُؤَادَ ضَاعَ فِى ذَاكَ الْفِنَا
وَاقْرَأِ السّلَامَ أُهَيْلَهُ عَنِّيْ وَصِفْ
مَا حَلَّ بِيْ بَعْدَ الْبِعَادِ مِنَ الضَّنَا
            
وَاسْتَعْطِفِ الْأَحْبَابَ كَيْمَا يَعْطِفُوْا
فَهُمُ هُمُوْا اَهْلُ الْمَكَارِمِ وَالثَّنَاءِ
وَاسْأَلْهُمْ بِاللهِ اَْن لَا يَقْطَعُوْا
حَبْلَ الْمُحِبِّ الْمُسْتَهَِامِ وَاِنْ جَنَا
            
قُلْ يَا كِرَامَ الْحَيِّ هَلْ مِنْ زَوْرَةٍ
اَوْ عَوْدَةٍ لِمَرِيْضٍ هََجْرٍ قَدْ حَنَا
لَمْ يُبْقِ هَذَا الْهَجْرُ مِنْ فَضَلَاتِهِ
اِلّاَ اِهَابًا ذَوْقَ عَظْمٍ قَدْ وَلَا

            """.trimIndent()))

            courseList.add(ListSholawatData("Sholawat Badar", """
صَـلا َةُ اللهِ سَـلا َمُ اللهِ
عَـلَى طـهَ رَسُـوْلِ اللهِ
صَـلا َةُ اللهِ سَـلا َمُ اللهِ
عَـلَى يـس حَبِيْـبِ اللهِ
        
تَوَ سَـلْنَا بِـبِـسْـمِ اللّهِ
وَبِالْـهَادِى رَسُـوْلِ اللهِ
وَ كُــلِّ مُجَـا هِـدِ لِلّهِ
بِاَهْـلِ الْبَـدْ رِ يـَا اَللهُ
        
اِلهِـى سَـلِّـمِ اْلا ُمـَّة
مِـنَ اْلافـَاتِ وَالنِّـقْـمَةَ
وَمِنْ هَـمٍ وَمِنْ غُـمَّـةٍ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
اِلهِى نَجِّـنَا وَاكْـشِـفْ
جَـمِيْعَ اَذِ يـَّةٍ وَا صْرِفْ
جَـمِيْعَ اَذِ يـَّةٍ وَا صْرِفْ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
اِلهِـى نَـفِّـسِ الْـكُـرَبَا
مِنَ الْعَـاصِيْـنَ وَالْعَطْـبَا
وَ كُـلِّ بـَلِـيَّـةٍ وَوَبـَا
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُُ
        
فَكَــمْ مِنْ رَحْمَةٍ حَصَلَتْ
وَكَــمْ مِنْ ذِلَّـةٍ فَصَلَتْ
وَكَـمْ مِنْ نِعْمـَةٍ وَصَلَـتْ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَلله
        
وَ كَـمْ اَغْـنَيْتَ ذَالْعُـمْرِ
وَكَـمْ اَوْلَيْـتَ ذَاالْفَـقْـرِ
وَكَـمْ عَافَـيـْتَ ذِاالْـوِذْرِ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
لَـقَدْ ضَاقَتْ عَلَى الْقَـلْـبِ
جَمِـيْعُ اْلاَرْضِ مَعْ رَحْبِ
فَانْـجِ مِنَ الْبَلاَ الصَّعْـبِ
بِا َهْـلِ الْبَـدْ رِ يـَا اَللهُ
        
ا َتَيـْنَا طَـالِـبِى الرِّفْـقِ
وَجُـلِّ الْخَـيْرِ وَالسَّـعْدِ
فَوَ سِّـعْ مِنْحَـةَ اْلاَيـْدِىْ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
فَـلاَ تَرْدُدْ مَـعَ الْخَـيـْبَةْ
بَلِ اجْعَلْـنَاعَلَى الطَّيْبـَةْ
اَيـَا ذَاالْعِـزِّ وَالْهَـيـْبَةْ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
وَ اِنْ تَرْدُدْ فَـمَنْ نَأْتـِىْ
بِـنَيـْلِ جَمِيـْعِ حَاجَا تِى
اَيـَا جَـالِى الْمُـلِـمـَّاتِ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
اِلهِـى اغْفِـرِ وَاَ كْرِ مْنَـا
بِـنَيـْلِ مـَطَا لِبٍ مِنَّا
وَ دَفْـعِ مَسَـاءَةٍ عَـنَّا
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
اِلهِـى اَنـْتَ ذُوْ لُطْـفٍ
وَذُوْ فَـضْلٍ وَذُوْ عَطْـفٍ
وَكَـمْ مِنْ كُـرْبـَةٍ تَنـْفِىْ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ
        
وَصَلِّ عَـلَى النـَّبِىِّ الْبَـرِّ
بـِلاَ عَـدٍّ وَلاَ حَـصْـرِ
وَالِ سَـادَةٍ غُــــرِّ
بِاَ هْـلِ الْبَـدْ رِ يـَا اَللهُ

            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Hanana", """
ظَهَرَ الدِّيْنُ الْمُؤَيَّد
بِظُهُوْرِ النَّبِى اَحْمَد
يَا هَنَانَا بِمُحَمَّد
ذَلِكَ الْفَضْلُ مِنَ اللَّه
يَا هَنَانَا
        
خُصَّ بِالسَّبْعِ الْمَثَانِى
وَحَوَى لُطْفَ الْمَعَانِى
مَالَهُ فِى الْخَلْقِ ثَانِىْ
وَعَلِيْهِ اَنْزَلَ اللَّه
يَا هَنَانَا
        
مِنْ مَكَّةٍ لَمَّا ظَهَرْ
لِاَجِلِهِ انْشَقَ الْقَمَرْ
وَافْتَخَرَتْ اَلُ مُضَرْ
بِهِ عَلَى كُلِّ الْاَنَامْ
يَاهَنَانَا
        
اَطيَبُ النَّاسِ خَلقًا
وَاَجَلُّ النَّاسِ خُلُقُا
ذِكرُهُ غَربًا وَشَرقًا
سَائِرٌ وَالحَمدُ لِله
يَاهَنَانَا
        
صَلُّوا عَلَى خَيْرِ الْاَنَامِ
اَلْمُصْطَفَىبَدْرِالتَّمَامِ
صَلُّوا عَلَيْهِ وَ سَلِّمُوا
يَشْفَعْ لَنَا يَوْمَ الزِّحَامِ
يَا هَنَانَا

            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Arhama Rohimin", """
        يَااَرْحَمَ الرَّحِمِيْنَ
        يَااَرْحَمَ الرَّحِمِيْنَ
        ااَرْحَمَ الرَّحِمِيْنَ
        فَرِّجْ عَلَى الْمُسْلِمِيْنْ
        
        يَا رَبَّنَا يَاكَرِيْم
        يَارَبَّنَا يَارَحِيْم
        اَنْتَ الْجَوَادُ الْحَلِيْم
        وَاَنْتَ نِعْمَ الْمُعِيْن
        
        وَلَيْسَ نَرْجُوْسِوَاكْ
        فَادْرِكْ اِلَهِيْ دَرَاكْ
        قَبْلَ الْفَنَا وَالْهَلَاكْ
        يَعُمُّ دُنْيَاوَدِيْنْ
        
        وَمَالَنَارَبَّنَا
        سِوَاكَ يَاحَسْبَنَا
        يَاذَاالْعُلَاوَالْغِنَى
        وَيَا قَوِيُّ يَامَتِيْنْ
        
        نَسْاَلُكَ وَالِى يُقِيْم
        الْعَدْلَ كَى نَسْتَقِيْم
        عَلَى هُدَاكَ الْقَوِيْمْ
        وَلَانُطِيْعُ اللَّعِيْن
        
        ارَبَّنَا يَامُجِيْبْ
        اَنْتَ لسَّمِيْعُ الْقَرِيْبْ
        ضَاقَ الْوَسِيْعُ الرَّحِيْبْ
        فَانْظُرْ اِلَى الْمُؤْمِنِيْنْ
        
        نَظْرَةْ تُزِيْلُ الْعَنَا
        عنَّا وَ تُدْنِى الْمُنَا
        مِنَّاوَكُلَّ الْهَنَا
        نُعْطَاهُ فِى كُلِّ حِيْنْ
        
        سَالَكْ بِجَاهِ الْجُدُوْدْ
        وَاِلَى يُقِّيْمُ الْحُدُوْدْ
        فِيْنَاوَيَكْفِى الْحَسُوْدْ
        وَيَدْفَعُ الظَّالِمِيْنْ
        
        يُزِيْلُ لِلْمُنْكَرَاتْ
        يُقِيْمُ لِلصَّلَوَاتْ
        يَاْمُرُ بِالصَّالِحَاِت
        مُحِبٌ للِصَّالِحِيْنْ
        
        يُزِيْحُ كُلَّ الْحَرَامْ
        يَقْهَرُ كُلَّ الطَّعَامْ
        يَعْدِلُ بَيْنَ الْاَنَامْ
        وَيُؤْمِنُ الْجَائِفِيْنْ
        
        رَبِّ اسْقِنَا غَيْثَ عَامْ
        نَافعْ مُبَارَكْ دَوَامْ
        يَدُوْمُ فِى كُلِّ عَامْ
        عَلَى مَمَرِّالسِّنِيْنْ
        
        رَبِّ احْيِنَا شَاكِرِيْنْ
        وَتَوَفَّنَا مُسْلِمِيْنْ
        نُبْعَثْ مِنَ الْاَمِنِيْنْ
        فِيْ زُمْرَةِ السَّابِقِيْنْ
        
        بِجَاهِ طَهَ الرَّسُوْلْ
        جُدْ رَبَّنَا بِالْقَبُوْلْ
        وَهَبْ لَنَا كُلَّ سُولْ
        رَبِّ اسْتَجِبْ لِىْ اۤمِيْنْ
        
        عَطَاكَ رَبِّيْ جَزِيْلْ
        وَكُلَّ فِعْلِكْ جَمِيْلْ
        وَفِيْكْ اَمَلْنَا طَوِيْلْ
        فَجُدْ عَلَى الطَّامِعِيْنْ
        
        يَارَبِّ ضَاقَ الْخِنَاقْ
        مِنْ فِعْلِ مَا لَا يُطَاقْ
        فَامْنُنْ بِفَكِّ الْغَلَاقْ
        لِمَنْ بِذَنْبِهْ رَهِيْنْ
        
        وَاغْفِرْلِكُلِّ الذُّنُوْبْ
        وَاسْتُرْ لِكُلِّ الْعُيُوبْ
        وَاكْشِفْ لِكُلِّ الْكُرُوبْ
        وَاكْفِ اَذَى الْمُؤْذِيِينْ
        
        وَاخْتِمْ بِاَحْسَنْ خِتَامْ
        اِذَا دَنَى الْاِنْضِرَامْ
        وَحَانَ حِيْنُ الْحِمَامْ
        وَزَادَ رَشْحُ الْجَبِينْ
        
        ثُمَّ الصَّلاَةْ وَالسَّلاَمْ
        عَلَى شَفِيْعِ الْاَنَامْ
        وَالْاَلِ نِعْمَ الْكِرَامْ
        وَالصَّحْبِ وَالتَّابِعِينْ
        
            """.trimIndent()))

            courseList.add(ListSholawatData("Habibi Ya Muhammad", """           
        حَبِيْبِيْ يَا مُحَمَّدْ 
         يَا صَادِقًا بِالْوَعْدْ
         
        يَا أَحْمَدْ يَا مُؤَيَّدْ 
         مِنَ الْفَرْدِ الصَّمَدْ
         
        يَا صَادِقَ الْمَقَالِ 
         يَا ذَا الْمَقَامِ الْعَالِيْ
         
        يَا مَنْ حَبَاهُ رَبِّيْ 
         بِطَيِّبِ الْأَفْعَالِ
         
        يَا مَنْ سَرَيْتَ لَيْلًا 
         مُصَاحِبًا جِبْرِيْلًا
         
        بِالْمَسْجِدِ الْأَقْصَى 
         فِيْ تِلْكَ اللَّيْلَةْ
         
        صَلَّيْتَ يَا مُحَمَّدْ 
         بِجَمْعِ الْمُرْسَلِيْنَ
         
        كُنْتَ فِيْهِمْ إِمَامًا 
         وَكَانُوْا مُقْتَدِيْنَ
         
        ثُمَّ بَعْدَ الصَّلَاةْ 
         سِرْتَ لِلسَّمَوَاتْ
         
        فَوْقَ ظَهْرِ الْبُرَاقِ 
         لِرَبِّ الْعَالَمِيْنَ
         
        بِبَهْجَةٍ وَسُرُوْرٍ 
         وَفَوْقَ السِّدْرَةِ
         
        وَأُنْسٍ وَحَبُوْرٍ 
         لِقُدْسِ الْحَضْرَةِ
         
        حَيَّ لَيْلَةْ هُنَا 
         وَقَدْ نِلْتَ الْمُنَى
         
        يَا مَنْ حَبَاهُ رَبِّيْ 
         بِطَيِّبْ الْأَفْعَالِ
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Dauni-Dauni", """
        دَ عُوْ نِي دَ عُـوْ نِي أُنَاجِي حَبِيْبِي
        وَلاَ تَعْذُ لُوْنِي فَعَذْ لِي حَرَامْ
        
        تَعَلَّمْ بُكَا يَ وَ نُحْ يَا حَمَامْ
        وَخُذْ عَنْ شُجُوْ نِي دُرُوْ سَ الْغَرَامْ
        تَعَلَّمْ بُكَا يَ وَ نُحْ يا حَمَامْ
        سَكَرْتُ بِخَمْرِ الْهَوَى وَ الْغَرَامْ
        
        وَ مَنْ كَانَ مِثْلِي مُعَنّى مُضَنّى
        بِحُبِّ النَّبِيِّ لمَا ذَا يُلا َمْ
        لاَ مُوْ نِي لاَ مُوْ نِي بِحُبِّكْ رَ مُوْ نِي
        يَاقُـرَّةْ عُيُوْنِي عَلَيْكَ السَّلا َمْ
        
        فُؤَ ادِ ي لِنَحْوِ الْمَدِ يْنَةِ هَامْ
        وَ قَلْبِي تَوَلَّعْ بِخَيْرِا ْلأَ نَا مْ
        أَنَا يَا ابْنَ رَامَةْ حُرِ مْتُ الْمَنَامْ
        وَ زَادَنِي سِقَامًا غَرَامُكْ تُسَامْ
        
            """.trimIndent()))

            courseList.add(ListSholawatData("Roqqot Aina ya Shawqan", """
        رَقَّتْ عَيْنَايَ شَوْقًا
        وَلِطَيْبَةَ ذَرَفَتَ عَشْقً
        فَأْتَيْتُ إِلَى حَبِيْبِى
        فَأَهْدَأْ قَلْبُ وَرِفْقًا
        صَلِّيْ عَلَى مُحَمَّدْ
        
        السَّلَامُ عَلَيْكَ يَا
        يَا رَسُولَ اللهْ
        السَّلَامُ عَلَيْكَ يَا
        حَبِيْبِى يَا نَبِيَ اللهْ
        يَا رَسُولَ اللهْ
        
        قَلْبٌ بِالْحَقِّ تَعَلَّقْ
        وَبِغَارِ حِرَاءَ تَعَلَّقْ
        يَبُكِيْ يَسْأَلْ خَلِقَهُ
        فَأَتَاهُ الْوَحْيُ فَأَشْرَقْ
        اِقْرَأْ اِقْرَأْ يَا مُحَمَّدْ
        
        يَا طَيْبَةُ جِئْتُكِ صَبَّا
        لِرَسُوْلِ اللهِ مُحِبَّا
        بِالرَّوْضَةِ سَكَنَتُ رُوْحِيْ
        وَجِوَارِ الْهَادِيْ مُحَمَّدْ
        
        السَّلَامُ عَلَيْكَ يَا
        يَا رَسُولَ اللهْ
        السَّلَامُ عَلَيْكَ يَا
        حَبِيْبِى يَا نَبِيَ اللهْ
        
            """.trimIndent()))

            courseList.add(ListSholawatData("Qomarun", """
                وَأَجْمَلُ مِنْكَ لَمْ تَرَقَطُّ عَيْن
                وَأَطْيَبُ مِنْكَ لَمْ تَلِدِ النِّسَاءُ
                خُلِقْتَ مُبَرَّءًا مِنْ كُلِّ عَيْبٍ
                كَأَنَّكَ قَدْ خُلِقْتَ كَمَا تَشَاءُ
                
                قَمَرٌ قَمَر قمرٌ سِيدْنَا النَّبِى قَمَرٌ
                وَجَمِيل وَجَمِيل وَجَمِيل
                سِيدْنَا النَّبِى وَجَمِيل
                
                وَكَفُّ الْمـُـصْطَفَى كَالْوَرْدِ نَادِي
                وَعِطْرُهَ يَبْقَى اِذَا مَسَّتْ أَيَادِي
                
                وَعَمَّ نَوَالُهاَ كُلَّ الْعِبَادِي
                حَبِيبُ الِله يَا خَيْرَ الْبَرَى يا
                
                قَمَرٌ قَمَر قمرٌ سِيدْنَا النَّبِى قَمَرٌ
                وَجَمِيل وَجَمِيل وَجَمِيل
                سِيدْنَا النَّبِى وَجَمِيل
                
                وَلَا ظِلُّ لَّهُ بَلْ كَانَ نُورَا
                تَنَالَ الشَّمْسَ مِنْهُ وَالْبُدُورَ 
                
                وَلَمْ يَكُنِ الْهُدَى لَوْلَا ظُهُورَه
                وَكُلُّ الْكَوْنِ أَنَارُ بِنُورِ طَه
                
                قَمَرٌ قَمَر قمرٌ سِيدْنَا النَّبِى قَمَرٌ
                وَجَمِيل وَجَمِيل وَجَمِيل
                سِيدْنَا النَّبِى وَجَمِيل
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Habibal Qolbi", """
               يَا حَبِيْبَ الْقَلْبِ يَا خَيْرَ الْبَرَا يَهْ
               يَا لِى جِئْتَ بِا لْحَقِّ رَسُوْ لَ الْهِدَايَهْ
               يَا رَسُوْ لَ الله يَا حَبِيْبَ الله
             
               يَوْمَ الْوِلَادَةْ كَا لْبِدَا يَةْ
               لِلْهِدَايَةْ ْ كَا لْبِدَا يَة
               يَوْمَ الْوِلَادَةْ كَا لْبِدَا يَةْ
              لِلْهِدَايَةْ ْ كَا لْبِدَا يَة 
             لِلْهِدَايَةْ ْ كَا لْبِدَا يَة  
             
               اِنْ تَجِدْ يَا طٰهٰ بِنُوْرِ الْهِدَا يَةْ
               يَا رَسُوْ لَ الله يَا رَسُوْ لَ الله
               جِئْتَ بِدِيْنِ الله جِئْت كُلَّ الْبَرَا يَةْ
               يَا حَبِيْبَ الله يَا حَبِيْبَ الله
               يَا بَشِيْرَالْخَيْر يَا رَسُوْ لَ الله
               يَا دَلِيْلَ النُّورْ يَا حَبِيْبَ الله
               
            """.trimIndent()))

            courseList.add(ListSholawatData("Laukana Bainanal Habib", """
                لَوْ كَانَ بَيْنَنَا الْحَبِيْب
                لَدَنَا القَاصِيْ وَالْقَرِيْب
                مِنْ طَيِّبَةٍ قَبْلَ الْمَغِيْب
                طَالِباً قُرْبَ الحَبِيْب
                
                بِقُرْبِهِ النَّفْسُ تَطِيْب
                وَتَدْعُوا الله فَيُجِيْب
                أَنْوَارُ طَهَ لاَ تَغِيْب
                بَلِّغْنَا لِقَاهُ يَا مُجِيْب
                
                هُدَاكَ الْكَوْنُ الرَّحِيْب
                رَحْمَةَ الْهَادِيْ الْقَرِيْب
                حَدِيْثُكَ النَّهْرُ الْعَذِيْب
                جِوَارُكَ الْغُصْنُ الرَّطِيْب
                
                فَدَتْكَ رُوْحِيَ يَا حَبِيْب
                مُحَمَّدٌ مُكْرِمَ الْغَرِيْب
                بِقُرْبِكَ الرُّوْحُ تَطِيْب
                يَارَحْمَةً لِلْعَالَمِيْن
                
                يَا حَبِيْبِيْ ياَ مُحَمَّدْ
                يَا طَبِيْبِيْ يَا مُمَجَّدْ
                أَنْتَ ذُوالْفَضْلِ الْمُؤَيَّدْ
                جَلَّ مَنْ صَلَّى عَلَيْك
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Al Itiraaf", """
                إِلهِي لَسْتُ لِلْفِرْدَوْسِ أَهْلاََ
                وَلاَ أَقْوَى عَلَى النَّارِ الجَحِيمِ
                
                فهَبْ لِي تَوْبَةً وَاغْفِرْ ذُنُوبِي
                فَإنَّكَ غَافِرُ الذَّنْبِ العَظِيْم
                
                ذُنُوبِي مِثْلُ أَعْدَادٍ الرِّمَالِ
                فَهَبْ لِي تَوْبَةً يَاذَاالجَلاَلِ
                
                وَعُمْرِي نَاقِصٌ فِي كُلِّ يَوْمٍ
                وَذَنْبِي زَائِدٌ كَيفَ احْتِمَالِي
                
                إلَهِي عَبْدُكَ العَاصِي أَتَاكَ
                مُقِرًّا بِالذُنُوبِ وَقَدْ دَعَاك
                
                فَإِنْ تَغْفِرْ فَأنْتَ لِذَاكَ أَهْلٌ
                فَإنْ تَطْرُدْ فَمَنْ نَرْجُو سِوَاكَ
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Ya Tarim", """
               يَا تَرِيْم يَا تَرِيْم 
                شَيْء لله شَيْء لله
                
                بَلْدَةُ الأَوْلِيَاء
                شَيْء لله شَيْء لله
                
                بِجَاهِ بَاعَلَوِيْ
                شَيْء لله شَيْء لله
                
                حَبِيْبُنَا الْكَرِيمْ
                شَيْء لله شَيْء لله
                
                سَقَافُنَا وَلِي
                شَيْء لله شَيْء لله
                
                اَلْمُحْضَرْ وَالْعَيْدَرُوسْ
                شَيْء لله شَيْء لله
                
                اَلحَدَّادْ وَالْعَطَّاسْ
                شَيْء لله شَيْء لله
                
                وَ جَمِيْعُ الْوَالِي
                شَيْء لله شَيْء لله
                
                وَهُمْ ذُرِّيَةُ النَّبِي
                شَيْء لله شَيْء لله
                
                بِجَاهِ النَّبِي
                شَيْء لله شَيْء لله
                
                بِجَاهِ شَيْخَنَا
                شَيْء لله شَيْء لله
                
            """.trimIndent()))

            courseList.add(ListSholawatData("Man Ana Lau Lakum", """
                مَنْ أَنَا مَنْ أَنَا مَنْ أَنَا لَوْلَاكُمْ
                كَيْفَ مَا حُبُّكُمْ كَيْفَ مَا أَهْوَاكُمْ
                
                مَا سِوَىَ وَلَا غَيْرَكُمْ سِوَاكُمْ
                لَا وَمَنْ فِي الْمَحَبَّةْ عَلَيَّ وَلَاكُمْ
                أَنْتُمْ أَنْتُمْ مُرَادِي وَأَنْتُمْ قَصْدِي
                لَيْسَ أَحَد فِي الْمَحَبَّة سِوَاكُمْ عِنْدِي
                
                مَنْ أَنَا مَنْ أَنَا مَنْ أَنَا لَوْلَاكُمْ
                كَيْفَ مَا حُبُّكُمْ كَيْفَ مَا أَهْوَاكُمْ
                
                كُلَّمَا زَادَنِى فِى هَوَاكُمْ وَجْدِي
                قُلْتُ يَا سَادَتِي مُحْجَتِي تَفْدَاكُمْ
                لَوْ قَطَعْتُمْ وَرِيْدِيْ بِحَدِّ مَاضِي
                قُلْتُ وَالله أَنَا فِى هَوَاكُمْ رَاضِي
                
                مَنْ أَنَا مَنْ أَنَا مَنْ أَنَا لَوْلَاكُمْ
                كَيْفَ مَا حُبُّكُمْ كَيْفَ مَا أَهْوَاكُمْ
                
            """.trimIndent()))

            return courseList as ArrayList
        }
    }

}